In [2]:
import pandas as pd

In [7]:
df= pd.DataFrame( {'user' : [1,2,3],
            'age' : [24,54,17],
            'sex' : ['F','F','M'],
            'occupation' : ['technician','musician','student']})
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [10]:
df[df.sex == 'F']

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician

In [11]:
df = pd.DataFrame( {
    'user' : [1,2,3], 
    'age' : [24,54,17], 
    'sex' : ['F','F','M'], 
    'occupation' : ['technician','musician','student']
})

In [16]:
df2 = df.loc[df.sex=='F'].copy()

In [17]:
df2.loc[0:1,'sex'] = 'Female'

In [18]:
df2

   user  age     sex  occupation
0     1   24  Female  technician
1     2   54  Female    musician

In [19]:
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student